
"""
----------------------------------------------------------------------------------------------------------------------------------
     _______.  ______  __      ___     .__   __..___________.|| __           __  __  __________      ___     ._______ ._____
    /       | /      ||  |    /   \    |  \ |  ||           |//\  \         /  /|  ||______    |    /   \    |   _   \|  _  \
   |   (----`|  ,----'|  |   /  ^  \   |   \|  |`---|  |----`   \  \   ^   /  / |  |     _/  _/    /  ^  \   |  |_)  || | \  \
    \   \    |  |     |  |  /  /_\  \  |  . `  |    |  |         \  \ / \ /  /  |  |   _/  _/     /  /_\  \  |   ____/| |  )  |
.----)   |   |  `----.|  | /  _____  \ |  |\   |    |  |          \  v   v  /   |  | _/  _/____  /  _____  \ |  |\  \ | |_/  /
|_______/     \______||__|/__/     \__\|__| \__|    |__|           \__/^\__/    |__||__________|/__/     \__\|__| \__\|_____/

----------------------------------------------------------------------------------------------------------------------------------

    Originally developed by G. Léandre

    Version : 1.4.0
    Year :    2026
    Authors : G. Léandre
"""


# +---------------------------+
# |   Window and GUI config   |
# +---------------------------+
WINDOW_TITLE  = "Sciantix'Wizzard"
# WINDOW_TITLE  = "Sciantix Input Wizzard"        # Alternative titles ?
# WINDOW_TITLE  = "Sciantix Input Builder"
# WINDOW_TITLE  = "Sciantix Gui"
WINDOW_WIDTH  = 1000
# WINDOW_WIDTH  = 1244        # If you want that sweet 16/9 aspect ratio
WINDOW_HEIGHT = 700

DEFAULT_OUTPUT_PATH = ""
DEFAULT_PLOT_PATH   = ""
DEFAULT_PLOT_NAME   = "plot"


# +---------------------------+
# |   Window and GUI config   |
# +---------------------------+
SIMULATION_PATH = "sciantix"
